# COMMANDS
HELP = (
    'помощь', 'помоги', 'подсказка', 'подскажи'
)
ABILITIES = (
    'умеешь', 'можешь'
)
PLAY = (
    'да', 'играть', 'давай', 'сыграем', 'поехали', 'ок',
    'го', 'сыграть', 'поиграем', 'поиграть', 'играем'
)
NAMED = (
    'какие', 'слова', 'отгадал', 'сказал', 'разгадал', 'назвал',
    'названы', 'названо', 'отгадано', 'сколько', 'исходное', 'главное',
    'повтори', 'какое', 'слово', 'всего', 'повторить'
)
STOP = (
    'нет', 'выход', 'хватит', 'пока', 'свидания', 'стоп', 'выйти',
    'выключи', 'останови', 'остановить', 'отмена', 'закончить',
    'закончи', 'отстань', 'назад', 'обратно', 'верни', 'вернись'
)
YES = (
    'да', 'конечно', 'ага', 'естественно', 'назад', 'выйти'
)
NO = (
    'нет', 'не', 'остаться', 'остаюсь', 'играть', 'дальше'
)

# BUTTONS
SOURCE_BTN = (
    'Сколько всего', 'Какое слово', 'Исходное слово', 'Сколько осталось'
)

# ANSWERS
HELLO = 'Привет! В этой игре вам нужно составлять слова из букв заданного слова.\n' \
        'Например, из слова "Котопёс" можно составить слово "кот". Начнём?'
HELLO_AGAIN = (
    'И снова здравствуйте!', 'Ещё раз привет!', 'С возвращением!', 'Ура, вы вернулись!'
)
YOUR_WORD = (
    'Итак, исходное слово: ', 'Итак, ваше слово: ', 'Исходное слово: ', 'Ваше слово: '
)
CONSTRUCT = (
    'Собирайте из его букв новые слова!', 'Разберите буквы этого слова и соберите новые!'
)
INCORRECT = (
    'Такие слова не подходят', 'Подумайте ещё', 'Такие слова нельзя составить', 'Попробуйте другие слова',
)
NOT_UNDERSTAND = (
    'Извините, я вас не поняла', 'Извините, я не понимаю', 'Извините, я не понимаю вас', 'Извините, я не поняла вас'
)
HELP_PLAY = 'Составьте из букв слова "{}" другие слова.'
HELP_HELLO = 'Правила просты: я даю вам слово, а вы составляяете из его букв другие слова.\n' \
             'Но следите за количеством букв - из слова "Санки" нельзя составить "Ананас".\n' \
             'Приступим?'
WHAT_YOU_CAN = 'Я помогаю вам провести время с пользой. С помощью этой игры вы развиваете память, ' \
               'а также узнаёте новые слова.'
